#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include "list22.c"
//--------------------------------------------------------------
//добавляем библиотеку функций чтобы занести их в массив функций
//--------------------------------------------------------------

//--------------------------------------------------------------
//структура задачи


typedef struct task_to_do
{
	unsigned int mem;
	unsigned int pid;
	unsigned int time_act;
	int 		 status;
	int 		 time_before_exec;

}Task;


List* create_list_for_queue();
List* create_list_for_executing();

Task* EnterTask (Task * FirtsTask);

void to_add_to_queue (Task* newone, List* queue);
void to_add_to_execution (Task* to_execute, List* lst);

void to_delete_a_task (Task* to_delete, List* lst);

void execution (Task* to_do, List* execution);





//--------------------------------------------------------------
//
//--------------------------------------------------------------



int main ()
{
	return 0;
}


//--------------------------------------------------------------
//список очереди
//--------------------------------------------------------------
List* create_list_for_queue()
{
	List* Queue = createList(); // создаю список на очередь
	return (Queue); 			// возвращаю список на очередь
}


//--------------------------------------------------------------
//cписок на выполнение
//--------------------------------------------------------------
List* create_list_for_executing()
{
	List* Queue = createList(); // создаю список на выполнение
	return (Queue); 			// возвращаю список на выполнение
}



//--------------------------------------------------------------
//ввод задачи
//--------------------------------------------------------------
Task* EnterTask (Task * FirtsTask);

//--------------------------------------------------------------
//проверка наличие свободных областей памяти для задачи
//--------------------------------------------------------------



//--------------------------------------------------------------
//отправка задачи в список очереди
//--------------------------------------------------------------
void to_add_to_queue (Task* newone, List* queue)
{

}

//--------------------------------------------------------------
// отправка задачи в список на выполнение
//--------------------------------------------------------------
void to_add_to_execution (Task* to_execute, List* execution)
{

}

//--------------------------------------------------------------
//удаление задачи из списка
//--------------------------------------------------------------
void to_add_to_execution (Task* to_delete, List* execution)
{

}

//--------------------------------------------------------------
//выполнение задачи 
//--------------------------------------------------------------
void execution (Task* to_do, List* execution)
{
	to_do->status = 1;
	deleteL(execution, to_do);
}

//--------------------------------------------------------------
//печать информации по задачам
//--------------------------------------------------------------
