//--------------------------------------------------------------
// Создает лист на ожидание
// Сразу выставляет статус 0 задачам, априоре невыполнимым
//--------------------------------------------------------------

List * wait_list_constructor(int n, Task * StructArray, int Memsize);

//--------------------------------------------------------------
//отправка задачи в список очереди
//--------------------------------------------------------------
void to_add_to_queue (Task* newone, List* queue);

//--------------------------------------------------------------
//удаление задачи из списка
//--------------------------------------------------------------
void to_delete_a_task (Task* to_delete, List* lst);

//--------------------------------------------------------------
// отправка задачи в список на выполнение
//--------------------------------------------------------------
void to_add_to_execution (Task* to_execute, List* lst, List* queue, AllocPart* AllocTableFree, int AlloctabPlacement);

//--------------------------------------------------------------
//выполнение задачи
//--------------------------------------------------------------

unsigned int execution (Task* to_do, List* execution, int *time);

//--------------------------------------------------------------
// ввод задачи
// Принимает на вход количество задач, возвращает массив структур Task
//--------------------------------------------------------------

Task * EnterTask (FILE* input, int n);

//--------------------------------------------------------------
//статус задачи
//--------------------------------------------------------------

void ftask_status(int n, Task * StructArray, FILE* output);